Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Star Chasing Boys (KO>EN).tmx
Source language: ko
Languages: en

source: 짧게 설명 하자면...
en: long story short...

source: ...하긴...
en: well, figures...

source: ..히잉
en: wahhh

source: 콰직
en: flicker

source: 설명드리겠으니 자리를 옮기시죠.
en: should we find another place? I will explain there.

source: 흔하지 않은 마법 발현
en: sure, we beat the odds...

source: 콰드득...
en: crack

source: 간절해야 한다면서요?
en: didn’t you say you need to be desperate?

source: 멍하니 있지 말고 움직이자!
en: we can’t stay here. let’s move!

source: 반갑다 너희의 마법트레이닝 겸 매니저를 맡게 된
en: nice to meet you all. I’m your magic trainer slash new manager...

source: 스타원'
en: “star one.”

source: 형이 제일 늦게 깨어났거든?!
en: you were the last to wake up!

source: 얼빵한 놈
en: you’re the worst, eugene.

source: ···송구하지만 그 아이의 마법 능력이 상상 이상이라,
en: the problem is, his magical power is beyond anyone’s imagination.

source: 솔이 형네 엄마 엄청 무섭네….
en: soule’s mom is intense...

source: 십분 안에 돌아올 거니까 너희들도 쉬어.
en: it won’t take me more than ten minutes, so you guys can take a break too.

source: 알리스터라고 합니다.
en: my name is allister.

source: 저 유빅 엔터에 스카우트됐어요.
en: I got an offer from UVIC entertainment.

source: 강민지 기사입력 20xx-xx-xx 08:40 | 수정 20xx-xx
en: Minji Kang, Posted xx-xx-20xx 8:40 AM | Updated xx-xx-20xx

source: 거기 꼼짝 말고 있어요!
en: don’t move and stay where you are!

source: 도망도 안 가네?
en: are you not going to run away?

source: 이 자식이..
en: you little...

source: 아니...
en: oh...

source: 아...응.
en: oh... yeah.

source: ..겉으로만 봐서는 그 마법을 썼던 사람인지 전혀 모르겠군..
en: I wouldn’t have guessed you were the one who used that magic.

source: 우리는 데뷔 이후 가장 바쁜 한 주를 보냈다
en: ...thanks to the sudden manifestation of magic.

source: 무대용 불꽃에도 놀라 자빠지는 판에
en: you just fell over backwards because of stage fireworks.

source: 챙강
en: clang

source: 알겠습니다.
en: fine.

source: 먼저 매니저 형이나 회사랑 얘기를 해보고 싶은데요.
en: we’d like to consult our manager or our agency before all that.

source: 어차피 마법도 못하는데
en: what’s the point of putting the other two in the center of the stage...

source: 형들은?
en: what about the other members?

source: 어릴 때 같은 아파트에서 살았고 학교도 고등학교까지 내내 같이 다녔어.
en: no. we grew up in the same neighborhood and went to the same schools until high school.

source: 마법 연습 더 열심히 해볼게!
en: I’ll practice my magic harder!

source: 흐아 힘들다...
en: phew... I’m exhausted.

source: 있는 거 다 꺼내자!
en: I want everything in it!

source: 쯧쯧
en: tsk tsk

source: 너희들이 원래 가지고 있던 것,
en: all I am doing is...

source: 할 수 있냐고요!
en: I asked if I can actually do this!

source: 왜 그런 짓을 했어요!{j}멤버들이 죽기라도 했으면 어쩌려고!
en: what were you thinking?! they almost died because of you!{j}

source: 도..도와주셔서 감사합니다!
en: th-thank you for your help!

source: 무리하지 말고 대피하세요.
en: don’t push yourself and go take cover.

source: 매니저도 1명으로 감축했다.
en: you only have one manager now.

source: 부웅-
en: vroom

source: 드디어 새로운 시대의 포문이 열릴 것입니다!!
en: ...the gates to a new era will finally open!

source: 이 사람 굉장히 예의 바른데…
en: he’s very polite and all...

source: 우선 안전한 곳으로 옮겨야 해
en: I need to get him to safety first.

source: 여러분들이 저희가 기다리던
en: you are the ones we have been waiting for!

source: 얼른 회사에 연락 넣어서…
en: let’s get in touch with uvic and--

source: 촤라락
en: swoop

source: 파팟-
en: whish

source: 일단 데려가 보자.
en: let’s take it home for now.

source: 앞으로 여러분의 인생에서 가장 중요한 이야기를 말이에요.
en: ...the most important things of your lives.

source: 툭
en: pat

source: 덥썩
en: grab

source: 갑자기 결정 됐나 보더라고.
en: yeah, it must’ve been a last-minute decision.

source: 끄응
en: urgh

source: 그럼요.
en: that is correct.

source: 팡팡
en: pow pow

source: 혀, 형...!
en: y-you guys...!

source: 이제 넌 끝났다!!
en: you’re done for!!

source: 고작 그런 잔재주로는 어림도 없...
en: ...but your cheap tricks won’t do any--

source: 비켄형에게 부탁을..
en: I’ll ask if viken can--

source: 이러다 부딪히겠어!!!
en: we’re gonna crash!

source: 핵심은 유진 형이 반드시 필요한 사람이라는 걸 회사도 유진 형도 인정할 수 있어야 한다는 거야.
en: the point is, both the agency and eugene need to recognize eugene is an indispensable part of our group.

source: 기사입력 20xx-xx-xx 08:40 | 수정 20xx-xx
en: Posted xx-xx-20xx | Updated xx-xx-20xx

source: 간절함은 누구나 있다.
en: everyone has a desperate heart.

source: 테이블 위에 있는 것 좀 치워 봐.
en: can you guys clear the table?

source: …저희가요?
en: and it’ll be us doing that?

source: 파닥
en: flap

source: 반응도 꽤 좋은 거 같아.
en: it looks like he’s getting a lot of positive response.

source: 끙
en: groan

source: ..트레이닝이라면 우리도 받아 본 적 있어요.
en: we’ve been trained before.

source: 너희 스스로를 그리고
en: they are the source of redemption...

source: 쾅!
en: slam

source: 꽥
en: ouch

source: 뭘 알아서 우리 아들을 여기로 데려 온 거고
en: what kind of information made you bring my son here...

source: 그런 소문이 있는 곳에서…
en: why your organization...

source: 유진 형이 그 파트에 들어가 줘야 무대가 멋질 텐데...
en: the part would really shine if eugene takes the center.

source: 여긴 위험하니까 안전한 곳으로 얼른 피하세요!
en: hurry and evacuate! it’s dangerous here!

source: 대타가 너희 밖에 시간 안되니까 부른거야.
en: we called you only because no one else was available to fill in.

source: 아까 너희들이 하던 얘기
en: are you going to tell me what you were talking about?

source: 이 덩쿨 같은 건 뭐야?!
en: what’s this vine-looking thing?!

source: 괜..찮아, 형.
en: i-it’s okay, avys.

source: 한 명 더 기절!
en: another passed out!

source: 전 무대에 비해 허전하지 않아?
en: isn’t this underwhelming compared to the previous performance?

source: 수많은 별들이 있듯이 수많은 세계가 있지.
en: there are millions of universes out there, just like there are an infinite number of stars.

source: 식사부터 하시겠습니까?
en: they asked me, “would you like something to eat?”

source: 그런가 봐.
en: I think so.

source: 통증을 줄이기 위해 치료마법을 걸겠습니다.
en: I will cast a healing magic to alleviate the pain.

source: 야!!
en: hey, you!!

source: 상처는??
en: how’s the wound?

source: 뭐라고?!!
en: what did you just say?!

source: 마법 없이도 잘 할 수 있다는 걸 보여주자!
en: let’s show them how well we can do even without magic!

source: 왜 우리가 이런 일을
en: how’s that a reason for us...

source: ..형들..{j}방금 차 흔들리지 않았어?
en: guys, am I the only one or did the car just shake?{j}

source: 전부 다른 걸 본 모양이네?
en: it seems like each of us saw something different.

source: ...문제는 우리야.
en: the problem is... us.

source: 누, 누구...?!
en: w-who are you?!

source: 내가 치유마법을 쓸 수 있었으면 좋았을 텐데
en: I could use healing magic myself.

source: 우리 지금 뭐에 홀린 건가?
en: are we seeing stuff?

source: 고양이가 말을 해?!
en: did that cat just talk?!

source: 꺄악!!{j}저기 봐!!
en: kyaaa! look!{j}

source: 친구?
en: a friend?

source: 응급실 다녀 올 테니 너희들은 숙소로 가.
en: I’ll take him to the emergency room. rest of you, go wait at home.

source: 싸늘
en: glare

source: 그리고 나무들이나 뭔가 좀...
en: and even the trees look a little strange...

source: 네 괜찮습니다.
en: no problem.

source: 아무튼 다 빼!!
en: no, take them out!

source: 내가 돌보는 아이들에게 무슨 짓이지?
en: how dare you mess with my boys?

source: 뭐든 간에!!!!
en: whatever it takes!

source: 아무래도 DK형 혼자서는 위험해!
en: it’ll be dangerous for DK to handle this alone!

source: 쿠당탕
en: thud

source: 꺄아아아-!!
en: aaahhhh!

source: 누구보고 멍청하대?
en: who are you calling ignorant?!

source: 확실히 수상하긴 해.
en: he does give off a suspicious vibe.

source: 병원에서 벗어 나지 않고 조용히 얘기 할 수 있는 공간으로 준비하겠습니다.
en: it will be somewhere quiet within the hospital.

source: 어라?!{j}뭐야??{j}아까 그 할머니는?
en: what in the world...? where did that granny go?{j}

source: 슥-
en: slide

source: 마법 발현 후 화려한 컴백 무대로 딱이네!
en: it’s the perfect timing to make a special comeback with their powers just unleashed!

source: 마법을 쓰는 보안요원이라…
en: security guards that use magic...

source: 부모님이랑 여러 번 참가하긴 했어요.
en: that taught kids how to use magic.

source: 진영이도
en: both jinyeong...

source: 아님 캠핑 중?
en: or are they camping?

source: 우리가 차력쇼를 하는 것도 아니고.
en: we’re not trying to do a circus here.

source: 우, 우리 살아 있는 거야?{j}분명 차에 들이박기 일보 직전이었는데..
en: d-did we survive? but we were this close to hitting the car...{j}

source: 뭐야?!
en: what?!

source: 하아..
en: ha...

source: 지금 너희 눈앞의 그것이 너희들의 진짜 이름,
en: the image that appears before you...

source: 자..{j}잠깐!!
en: w-wait!!{j}

source: 부상이 심합니다.
en: you’ve sustained a serious injury.

source: 제발!!
en: come on!!

source: 맞아!
en: right!

source: 제 7 화
en: Episode 7

source: 이 얘기 맨날 형이 우리한테 하던 말이야.{j}안 그래?
en: ...is what you’ve always told us. remember?{j}

source: 그건 아무나 함부로 가질 수 있는 능력이 아니야.
en: that power can’t be wielded by just anyone.

source: 당연히 원하지만...
en: of course I do.

source: 저희가 운명의 소년들로 예상한 아이돌 무대에
en: there were other idols on stage...

source: 31병동 입원실
en: Ward 31 Inpatient Units

source: 가만히 안두겠어!!
en: you asked for it!!

source: 알았어요.
en: all right, if you say so.

source: 이 촉박한 시간 안에 우리가 논의해야 할 건 뭐다?
en: now that we don’t have much time left, where should we start?

source: 그런데 자신이 어떤 힘을 가졌는지, 어떻게 다루는지도 모르고 있다니..
en: but you don’t seem to understand your power, let alone how to handle it.

source: 전에 1군 누가 테러 단체한테 덤비다 불구됐잖아..
en: cuz one of the T1s almost died trying...

source: 진영이다.{j}그러고 보니 연락 못 한지 오래됐네.
en: it’s jinyeong. come to think of it, I haven’t talked to him in a while.{j}

source: 드륵
en: slide

source: 그렇다면 더더욱 살려 둘 수 없다!!
en: if that’s the case, we can’t let them make it out alive!!

source: 콰과곽
en: swipe

source: 뭐하느라 이렇게 늦어?!
en: what took you so long?!

source: 묻고 싶은 게 여기가 어디냐가 아닐 텐데
en: are you sure that’s what you want to ask?

source: 나조차도 아직 내 마법에 확신이 없으니까.
en: even I’m not confident in mine.

source: 얼른 뒤로 피해!
en: now!

source: 생방 보자마자 반해서 스타원 팬카페 가입했어요ㅠ
en: Joined their fancafe after watching them live <3

source: 으아아앙
en: wahhh!

source: 형!!
en: dk!!

source: 공동기획
en: co-planning

source: 그래.{j}결국 이렇게 될 일이었어.
en: this was meant to happen, no matter what.{j}

source: 계세요?
en: hello?

source: 우리도 위기에 처했을 때 자기 몸 하나는 건사할 수 있어야지
en: we should at least be able to defend ourselves in danger.

source: 대신 식물이 적은 공간에서는 그만큼 식물의 가호를 받기 힘들 테니 주의가 필요해.
en: but he’ll need to be careful in deserted areas as there won’t be enough plants to protect him.

source: 무대로 보여드리겠습니다.
en: you can look forward to our performances.

source: 저 애들은?!
en: they’re children!

source: 이거 어디서 났지?{j}꽤 상위 마법서인데
en: where did you find this? this is a pretty advanced spellbook.{j}

source: 뭐..알아서 해라.
en: well, I’m sure you’ll figure it out.

source: ....어?
en: huh?

source: 피식
en: smirk

source: 이제 그동안 투자해 주신 게 아깝지 않으실 겁니다.
en: I’m sure your investment will not go to waste.

source: 그래 해보자!
en: okay, why not?!

source: 자, 그럼 무엇을 볼 수 있을지 한 번 보자꾸나
en: all right. let’s see what appears before you.

source: 여기가 어딘가요?
en: do you happen to know where we are?

source: 옙
en: all right!

source: 이 타이밍에 이렇게 나타났다면 이놈들 정체가 뭔지 예상이 되는군.
en: judging from how they showed up after everything’s been settled, I can see who these people are.

source: 책?
en: a book?

source: 우리를 시험하려고 사고까지 낸 사람이야.
en: dk caused a car accident just to test us.

source: 서늘..
en: chills

source: 이건 꽤 상위 레벨의 마법서야, 아무나 읽을 수 없어.
en: this spellbook is an advanced-level one. not everyone can read this.

source: 눈 돌리지 말고
en: do not look away.

source: ...큰 무대라 긴장했나봐.
en: I must’ve been nervous about performing on such a big stage.

source: 이 얘기 맨날 형이 우리한테 하던 말이야.
en: ...is what you’ve always told us.

source: 난 내가 왕자라도 된 줄?
en: ...but now, I feel like a prince!

source: 저번에도 그렇고 도대체 이 사람들 왜 우리를 계속…
en: this isn’t the first time they’ve come after us...

source: 다들 뭐하고 있어?{j}119 불러야지!
en: why are you all just watching him bleed? we should call 911!{j}

source: 조건이 갖춰진다면 누구나 마법을 쓸 수 있다는 소리다.
en: in other words, anyone who checks that box can use magic.

source: 아주 많은 걸 배울 수 있을거다.
en: you’ll get to learn a lot.

source: 웅성...
en: murmur

source: 꾸와악
en: yank

source: 아직 몸도 다 안 나았을 텐데 형 혼자 무리하네..
en: soule’s pushing himself too hard and he’s still recovering...

source: 넌 그게 문제냐…
en: that’s what you’re worried about?

source: 나도 그렇게 생각해.
en: I agree.

source: 그 애가 소중히 여기고 지키고 싶어 하는 것들 말이야.
en: make use of what he values most.

source: 이번 방송의 보안을 맡은 업체 직원입니다.
en: we’re from the security company hired for this shoot.

source: 벌렁
en: tremble

source: ...뭐야 특별게스트라며?
en: wait, didn’t they say it was a special guest?

source: 진짜 운명의 아이들이든, 그렇지 않든
en: whether they’re really the boys of destiny or not...

source: 오늘은 날씨가 무척 좋습니다.
en: the weather is beautiful today.

source: 혹시 어디 아픈 건가?
en: are you not feeling well, buddy?

source: 평소의 기세 넘치던 형 어디 갔어?
en: where’s my enthusiastic, passionate eugene?

source: 그때부터 지금까지 많은 기대를 걸었고
en: since then, we have had high expectations...

source: 튀어!!!
en: run!

source: 흐읍!!
en: ack!!

source: 그땐 어떻게 할 거야?
en: what would we do then?

source: 타다다..
en: ta da da

source: 응 맞아.
en: you’re right.

source: 굳이 힘든 길을 가려는 걸 응원하기는 힘들 거 같구나.
en: ...I don’t think I can support your decision to tread a difficult path.

source: 피핏
en: slash

source: 타호 넌 괜찮아?
en: you all right, taho?

source: 후웁
en: inhale

source: ...저...
en: ummm...

source: 그럼 비켄은?!
en: if so, what about viken?!

source: 괜찮겠지?
en: I hope he’ll take it well.

source: 아비스?!!
en: avys?!

source: 대표님이랑 김PD님이 너랑 따로 할 얘기가 있으시다는데.
en: the ceo and director kim wants to talk with you in private.

source: 자..
en: w--

source: 헐...
en: seriously...?

source: 괜찮아, 크게 다친 건 아니래.
en: I’ll be fine. the doctor said it’s not that serious.

source: 너희들의 근원의 마법(origin)을 개방시켜 준 게 나니까.
en: I was the one who opened up the origin for you.

source: 지금 너희들에게 가장 필요한 곳이지.
en: it’s the best place for people like you guys.

source: 얼른 동선 맞춰야 돼.{j}타이밍이 중요하다고.
en: we need to coordinate our dance moves. timing matters.{j}

source: 이 정도?
en: about this big?

source: 그러려고 했는데...
en: I was about to, but...

source: 사고 난 거 사과 드릴 겸...
en: I wanted to apologize for the earlier incident.

source: 이거 어디서 났지?
en: where did you find this?

source: 그때 이후로...{j}많이 좋아 졌을까
en: I wonder if he’s gotten better since then.{j}

source: 서둘러요!!
en: hurry!!

source: 표지가 바뀌었네?
en: but the cover looks different.

source: 뭐야?!{j}타호 너...!
en: what was that?! taho did you...?{j}

source: 아… 예.
en: oh...

source: 스타원!{j}최종 리허설 들어갑니다!!
en: the final rehearsal for star one is up!!

source: 우리 곧 컴백 무대야.
en: our comeback performance is coming up soon.

source: 웅성
en: murmur

source: X발...{j}이래서 2군 폐급은 부르지 않는 건데
en: seriously... this is why we never invite tier two groups.{j}

source: 헉?!
en: huh?!

source: 설마···
en: oh...

source: 그러지 말고 그냥 까놓고 말하는 게 어떨까요?
en: why don’t you get straight to the point?

source: 강력한 힘을 원해?
en: ...strong enough to defeat anyone?

source: 위급한 순간에 갑자기 그런 강한 마법을 쓸 수 있게 된 거
en: we were suddenly able to use powerful magic in a moment of crisis.

source: 지금은 무대에 오르는 것과는 다르다는 거.
en: I know that this is nothing like performing magic on stage.

source: 물이나 한잔 마시고 와야겠다.
en: I should go get a glass of water.

source: 그래.{j}너무 신경 써서 그런 꿈을 꾼 걸 거야.
en: yeah, I probably just had a dream like that because of stress.{j}

source: 싸아아..
en: crickets

source: 칙
en: spritz

source: ...사라졌어..
en: it disappeared...

source: 면목 없습니다.
en: my apologies.

source: 신경 써준 거 너무 고마운데...{j}너희들이 그렇게까지 해서 날 띄워 줄 필요가 있을까?
en: it’s very kind of you guys, but... is it really necessary for you to take the risk just to put me in the center of everything?{j}

source: 그 중에서도 야심차게 준비한 아이돌
en: among them, some are particularly ambitious.

source: 저 같은 경우는 소통!
en: we’ll engage with our fans more!

source: 그런데 매니저 형은…
en: where’s our manager--

source: 우..
en: w-

source: 우리 기죽지말고 연습한 대로만 하자.
en: don’t be discouraged. let’s just do as we practiced.

source: 어찌 됐든 가보자.{j}여기 계속 있을 순 없잖아
en: why don’t we check it out? we can’t just stand here doing nothing.{j}

source: 아냐, 아무것도.
en: oh, nothing.

source: 형들은?{j}다들 괜찮아?
en: what about you guys? is everyone okay?{j}

source: ...그냥
en: I just wish...

source: 수고하셨습니다!{j}최종 리허설 끝냅니다!!
en: great job, everyone! we’ll wrap up the rehearsal here.{j}

source: 폭발적인 마법으로 인명피해 최소화
en: protects crowd with powerful magic.

source: 사랑스러운 아이야.
en: our dear child.

source: 여기 적힌 거 진짜 할 수 있어요?
en: can I really do as it says here?

source: 열심히 하려고.{j}응원해 주는 친구도 있고...
en: yeah, but a friend of mine is rooting for me so I’m trying to do the best I can.{j}

source: 왜 난 안 되는 거야!
en: give me something, please!

source: 수군
en: whisper

source: 뭐 하는 거야!!
en: what are you doing?!

source: 흐느적~~
en: wobble

source: 이렇게 허무하게 죽는구나
en: I guess this is it for us, just like that.

source: 아이돌 테러범들도 어떻게 대응할 건지도 생각해 봐야 돼
en: we also need to think of a way to deal with those k-pop band terrorists.

source: 지금부터 스타원의 치료가 끝날 때까지
en: you are not to disclose...

source: 그래도 슬슬 어떻게 하면 될지 감 잡았어.
en: I have a better feel for this though.

source: 저 정도로는 큰 탈은 없을 거다.
en: this level of magic shouldn’t affect him too much.

source: 이제 막 마법이 발현된 당신들은 멸룡도가 다수와 맞서기에는 아직 위험합니다.
en: fighting against members of the dragon slayer clan is dangerous for you who’ve just manifested.

source: 솔이 형을 풀어 달라고!
en: I said, let soule go!

source: 쫄지 마.
en: keep your head up. you’re more good-looking than them.

source: 활?!
en: a bow?!

source: 비켄까지 앞뒤 생각 없이 달려가면 어떡해!
en: even viken’s going at it recklessly!

source: 어디 아픈지 영 움직임이 둔한 거 같아서 데려왔어
en: it wasn’t moving at all, probably because of the leg injury... so I brought it with me.

source: 깨워서 미안
en: sorry for waking you up.

source: 솔이 네 수준에 맞는 트레이닝은 물론
en: soule, I’ll train you at the right level.

source: 할 수 있는 건 다 해봐야지!
en: we should do everything we can!

source: 거창한 투자를 받고 시작했지만 모두 흥행에 실패!
en: they received a hefty investment to start out, but they failed to take off!

source: ...너 답긴 하다.
en: that... does sound typical of you.

source: ···안돼
en: no...

source: 겨우 서게 된 무대였는데...
en: after getting looked down on for being tier two idols that never made it.

source: 여길 보려무나.
en: look up here.

source: 도와줘!!
en: help!!

source: 해독제는 아직 개발 되지도 않았고...
en: an antidote hasn’t been developed yet...

source: ....너희 누구야
en: who are you...?

source: 피 나잖아!
en: bleeding!

source: 정말 가능성이 많은 분들인 거 같습니다.
en: I do think this group has great potential.

source: 거기 적힌 대로 할 수 있는 거죠?
en: ...does that mean I can do as what’s written there?

source: 뭐하러요?
en: why bother?

source: 손님~ㅎㅎ
en: haha

source: 재활용
en: Recycle

source: 구현하는 마법
en: their magical abilities?

source: 비켄이 마법으로 치료 해준다고 해도 결국 대가를 치러야 하는 건 똑같잖아.
en: even if viken heals with his magic, it doesn’t change the fact that he’d also have to bear the consequences.

source: 와…성질머리 더러운 고양이네 친해지기 싫다
en: wow... I really don’t want to be friends with that mean cat.

source: 많이 힘들 텐데 이런 응원 메시지도 보내주고...
en: he sent me such an encouraging message when he must be struggling himself.

source: 오~ 신기해
en: whoa, that’s cool!

source: 우선 여러분들을 만난 저의 기쁨을 설명해야겠네요.
en: first, I should tell you how pleased I am to meet you.

source: 표지가 바뀌었네?{j}왜지?
en: but the cover looks different. why’s that?{j}

source: 그럼 그 친구 계속 병원에 있는 거야?
en: so he’s been in an hospital?

source: 좋아요
en: Like

source: 믿겨져?!
en: they gave me options for breakfast!!

source: 얘기 잘될 거야.{j}우린 얼른 동물병원부터 다녀오자.
en: I’m sure it’ll go well. let’s hurry and find a vet clinic for this one.{j}

source: 제가 솔이 형 몫까지 할게요!!
en: I’ll cover for soule.

source: 마법은 세계의 안전과 부흥에 큰 힘이 되어 주기 때문이죠.
en: and that is because magic contributes greatly to the world’s safety and revival.

source: 설마...
en: wait. it can’t be...

source: DK형이랑 멤버들 좀 찾아봐!{j}다들 무사한지!
en: can you go find dk and the other members and check if they’re okay?!{j}

source: 여긴 내 세계가 아냐.
en: this is not my universe.

source: 파라락
en: rustle

source: 최근 활동:{j}3시간 전
en: Last activity:3 hours ago{j}

source: 설마?!
en: no way, are they...?!

source: 얘기 잘될 거야.
en: I’m sure it’ll go well.

source: 크게는 물, 불, 염력과 같은
en: ...to unleashing superhuman powers...

source: 어떻게 된...
en: just happened...

source: 테러?!
en: “terrorizes idols”?!

source: 콰드드
en: crack

source: …어릴 때 마법을 알려주는 행사가 많아서
en: I went to a lot of events with my parents...

source: 훗
en: ha

source: 자세히 얘기를 안 해주네.
en: he wouldn’t tell me the details.

source: 아, 얘가 말을 걸어서~
en: oh, nothing! I was talking to this plant.

source: 제가 따로 찾아갈게요.
en: I’ll talk to her later.

source: ...제 간절함이 부족하니 발현이 늦었다는 거예요?
en: do you mean mine was demonstrated later because I hadn’t been desperate enough?

source: 그건 도대체…
en: ...I had last night...

source: 당신들… 누굽니까?
en: who... are you people?

source: 그래.{j}꽤나 끔찍했을 거야.
en: yes, it must’ve been awful.{j}

source: 확실히..우리에게 필요한 사람이야.
en: ...but we definitely need him.

source: 어머니처럼은… 못하겠지만
en: I probably can’t be as great as you...

source: 가면 온다!!
en: the masked man!

source: 네 주변 모두를 잃게 될 거다.
en: ...you’ll lose everyone around you.

source: 훈련을 거듭할수록 능력이 커지지.
en: the more you train, the greater your power becomes.

source: 잘 해봐
en: good luck.

source: 이용당하게 해서 미안
en: sorry for letting them take advantage of you.

source: 휘리릭
en: grab

source: 하지만 상업성이 강한 연예계에 막대한 투자를 하면서도
en: but even as they invest heavily in the lucrative entertainment industry...

source: 형!!{j}조심!!
en: watch out, dk!!{j}

source: 마법은 트레이닝이 전부다.
en: magic is all about practice.

source: 소설책 인가?
en: is this a novel?

source: 이야~ 그림 좋네
en: looking good!

source: 형한테 따지려는 건 아니야…
en: I’m not angry at you, by the way.

source: 마법도 못 쓰는 게 잘도 도망가더니
en: can’t really run far without magic, now can you?

source: 지켜보니 아비스는 자신을 대신해서 힘을 사용해 줄
en: it seems like avys can summon creatures...

source: 자선단체 마냥 명확한 대가를 바라지도 않으니
en: ...they’ve never expected anything in return as if they’re a charity organization.

source: 인마?!
en: huh?!

source: 예!!
en: yes, sir!

source: 한심한 자식!
en: how pathetic of me!

source: 난동 피우는 사람들 수를 꽤 줄인 것 같아!
en: looks like we took down most of those masked riots!

source: 방송국이 어지간히 급했나보네~
en: the broadcast station must’ve been desperate.

source: 아직 노래가 안끝났는데...
en: the song isn’t over yet...

source: 같이 가요!
en: we’ll come with you!

source: 그게 뭐야?
en: what is that?

source: 네, 그래도 마법 못쓰는 애들 중에는 제일 쓸 만해요.
en: yes, but they’re the most decent out of the non-magic idols.

source: ...뭐야..
en: what...

source: 춤 영상..많이 찍어 올리는 거..?
en: we’ll post a lot of... dance videos?

source: 이대로 아무것도 못 하고 당하고만 있을 순 없어.
en: I can’t just let them hurt us without trying to do anything.

source: 함께 가실 겁니다.
en: ...will come with you.

source: 너희들이 봐야만 하는 것들을 똑바로 보거라
en: look squarely at what you must face.

source: 잠깐 다녀오자.
en: we’ll be right back.

source: 너 같은 놈들은 혼쭐이 나야 정신을 차리지.
en: guys like you deserve a good blow.

source: 전 발현도 안 했고 차라리 이 시간에 안무 연습하는 게 더 나을 거 같은데요.
en: I didn’t manifest magic yet so I feel like it’ll be a better use of time to practice my moves instead.

source: 두 분의 회사에 저희 측에서 연락을 드리느라 시간이 좀 걸렸습니다.
en: it took us a while to contact your respective agencies.

source: 나중에 만날 때 놀라게 해줘야지~
en: I’ll surprise him next time we meet up.

source: 안 돼!!
en: no!!

source: 부딪힐 때 느꼈어!!
en: Ifelt it when the van came to a stop.

source: 쇄액
en: loom

source: 아니, 엄마의 반의 반만큼이라도
en: no, if only I had even half of the magical powers...

source: 위험해!!{j}피해!
en: watch out! run!{j}

source: 감사합니다.
en: thank you, sir.

source: 운명의 소년들입니다!!
en: the boys of destiny!!

source: 못마땅...
en: hmph

source: 지금부터 내가 하는 말에 무조건 그렇게 하겠다고 해!
en: please say yes to whatever I’m about to ask you right now.

source: 지금 할 수 있는 게 이 정도 밖에 안 돼서...
en: unfortunately, this is the best I can do at the moment...

source: 들어 본 적 없어요?
en: have you heard of them?

source: 네가 쓰러져서 많이 놀랐나 봐
en: he must’ve been scared to death that you passed out.

source: 솔님을 안전한 곳으로 모시겠습니다.
en: we will take mr. soule to a safer place.

source: 옙!!{j}ㅠㅠ
en: yessir!!{j}

source: 마법을 사용해 누군가를 보호한다는 결과는 같아도 사람마다 실현 가능한 방법이 달라.
en: in the end, we all protect people with magic. how we do it is what differs.

source: 이제 숨기는 거 의미 없지 않아?
en: I don’t see the point in keeping secrets anymore.

source: 가자!!
en: let’s go

source: 내가 갈게!
en: I’ll go.

source: 포션의 효과에는 개인차가 있습니다.
en: the potion works better on some than others.

source: 진짜 우리를 생각하는 거면 형 혼자 다 책임지려고 하면 안 돼.
en: if you really care about us, don’t try to protect us all on your own.

source: 맞아.
en: yeah.

source: 뭔지 말 안 해 줄 거야?{j}솔직히 말해준다며?
en: I heard you mention my name and how you don’t want to keep secrets anymore.{j}

source: 최근 활동:
en: Last activity:

source: 나… 무대에 서고 싶어요.
en: I... want to perform on stage.

source: 오늘도 하드했다....
en: today was another grueling day...

source: 엄청 아플 거 같아.
en: it must hurt a lot.
